In [1]:
import os
import pandas as pd
import geopandas as gpd

import numpy as np

In [3]:
path = os.path.join('i2p_data','listing') # A default location to save raw data
fn=['2015-05-listings.csv','2016-06-listings.csv','2017-03-listings.csv','2018-05-listings.csv','2019-04-listings.csv']

In [4]:
cols=['id','host_id','host_since','first_review', 'last_review','latitude', 'longitude']
df15 = pd.read_csv(os.path.join(path,fn[0]), low_memory=False, usecols=cols)
df16 = pd.read_csv(os.path.join(path,fn[1]), low_memory=False, usecols=cols)
df17 = pd.read_csv(os.path.join(path,fn[2]), low_memory=False, usecols=cols)
df18 = pd.read_csv(os.path.join(path,fn[3]), low_memory=False, usecols=cols)
df19 = pd.read_csv(os.path.join(path,fn[4]), low_memory=False, usecols=cols)
print(f"Data frame is {df15.shape[0]:,} x {df15.shape[1]}") 
print(f"Data frame is {df16.shape[0]:,} x {df16.shape[1]}") 
print(f"Data frame is {df17.shape[0]:,} x {df17.shape[1]}") 
print(f"Data frame is {df18.shape[0]:,} x {df18.shape[1]}") 
print(f"Data frame is {df19.shape[0]:,} x {df19.shape[1]}")

Data frame is 18,436 x 7
Data frame is 42,646 x 7
Data frame is 53,904 x 7
Data frame is 69,886 x 7
Data frame is 79,671 x 7

In [5]:
frame=[df15,df16,df17,df18,df19]

In [6]:
for i in frame:
    i.drop(i[i.id.isna()].index.values, axis=0, inplace=True)
    print(f"Data frame is {i.shape[0]:,} x {i.shape[1]}")

Data frame is 18,436 x 7
Data frame is 42,646 x 7
Data frame is 53,904 x 7
Data frame is 69,886 x 7
Data frame is 79,671 x 7

In [7]:
df16.head()

,id,host_id,host_since,latitude,longitude,first_review,last_review
0,6781198,21869529,2014-09-28,51.398883,-0.278265,2015-07-24,2016-01-09
1,5290274,27396120,2015-02-08,51.421111,-0.280557,2015-04-06,2015-05-12
2,4023781,20860377,2014-09-02,51.414036,-0.286075,2014-10-05,2015-12-19
3,5098744,26345340,2015-01-19,51.413899,-0.306505,2015-02-28,2016-02-18
4,11093420,52632402,2015-12-29,51.408234,-0.291167,2016-02-09,2016-04-01

In [8]:
listing15 = gpd.GeoDataFrame(df15,geometry=gpd.points_from_xy(df15.longitude,df15.latitude,crs='epsg:4326')).to_crs('epsg:27700')
listing16 = gpd.GeoDataFrame(df16,geometry=gpd.points_from_xy(df16.longitude,df16.latitude,crs='epsg:4326')).to_crs('epsg:27700')
listing17 = gpd.GeoDataFrame(df17,geometry=gpd.points_from_xy(df17.longitude,df17.latitude,crs='epsg:4326')).to_crs('epsg:27700')
listing18 = gpd.GeoDataFrame(df18,geometry=gpd.points_from_xy(df18.longitude,df18.latitude,crs='epsg:4326')).to_crs('epsg:27700')
listing19 = gpd.GeoDataFrame(df19,geometry=gpd.points_from_xy(df19.longitude,df19.latitude,crs='epsg:4326')).to_crs('epsg:27700')
    #gdf=gpd.sjoin(boro, listing, how='inner').drop(columns=['latitude','longitude','index_right'])
    #gdf_1 = gdf.groupby('GSS_CODE')['id'].agg(Number_of_Listings_2015='count').reset_index()

In [9]:
boro = gpd.read_file(os.path.join('data','geo','Boroughs.gpkg'), driver='GPKG')

In [10]:
listings=[listing15,listing16,listing17,listing18,listing19]

In [11]:
gdf15=gpd.sjoin(boro, listing15, how='inner').drop(columns=['latitude','longitude','index_right'])
gdf16=gpd.sjoin(boro, listing16, how='inner').drop(columns=['latitude','longitude','index_right'])
gdf17=gpd.sjoin(boro, listing17, how='inner').drop(columns=['latitude','longitude','index_right'])
gdf18=gpd.sjoin(boro, listing18, how='inner').drop(columns=['latitude','longitude','index_right'])
gdf19=gpd.sjoin(boro, listing19, how='inner').drop(columns=['latitude','longitude','index_right'])

In [18]:
gdf15_1 = gdf15.groupby('GSS_CODE')['id'].agg(Number_of_Listings='count').reset_index() 
gdf16_1 = gdf16.groupby('GSS_CODE')['id'].agg(Number_of_Listings='count').reset_index() 
gdf17_1 = gdf17.groupby('GSS_CODE')['id'].agg(Number_of_Listings='count').reset_index() 
gdf18_1 = gdf18.groupby('GSS_CODE')['id'].agg(Number_of_Listings='count').reset_index() 
gdf19_1 = gdf19.groupby('GSS_CODE')['id'].agg(Number_of_Listings='count').reset_index()

In [19]:
df15_1 = pd.DataFrame(gdf15_1)
df16_1 = pd.DataFrame(gdf16_1)
df17_1 = pd.DataFrame(gdf17_1)
df18_1 = pd.DataFrame(gdf18_1)
df19_1 = pd.DataFrame(gdf19_1)

In [20]:
a='Year'
df15_1[a]=2015
df16_1[a]=2016
df17_1[a]=2017
df18_1[a]=2018
df19_1[a]=2019

In [23]:
frame1=[df15_1,df16_1,df17_1,df18_1,df19_1]
Airbnb_listing = pd.concat(frame1)

In [24]:
Airbnb_listing

     GSS_CODE  Number_of_Listings  Year
0   E09000001                 118  2015
1   E09000002                   7  2015
2   E09000003                  65  2015
3   E09000004                   5  2015
4   E09000005                 146  2015
..        ...                 ...   ...
28  E09000029                 252  2019
29  E09000030                7653  2019
30  E09000031                1292  2019
31  E09000032                4041  2019
32  E09000033                8863  2019

[163 rows x 3 columns]

In [2]:
path = os.path.join('i2p_data','demographic')
fn=['crime-rates.csv','education.csv','income.csv']

In [3]:
#df_cr = pd.read_csv(os.path.join(path,fn[0]), low_memory=False)
df_ed = pd.read_csv(os.path.join(path,fn[1]), low_memory=False)
df_in = pd.read_csv(os.path.join(path,fn[2]), low_memory=False)

#print(f"Data frame is {df_cr.shape[0]:,} x {df_cr.shape[1]}") 
print(f"Data frame is {df_ed.shape[0]:,} x {df_ed.shape[1]}") 
print(f"Data frame is {df_in.shape[0]:,} x {df_in.shape[1]}")

Data frame is 5,558 x 8
Data frame is 52 x 56

In [42]:
df_ed.head()

,Code,Area,Year,Qualifications of working age population (16-64),number,denominator,percent,confidence
0,E09000001,City of London,2004,NVQ4+,"3,500","4,300",80.6,*
1,E09000002,Barking and Dagenham,2004,NVQ4+,"14,300","101,800",14.1,3
2,E09000003,Barnet,2004,NVQ4+,"77,100","206,600",37.3,4
3,E09000004,Bexley,2004,NVQ4+,"21,400","134,900",15.8,3.3
4,E09000005,Brent,2004,NVQ4+,"43,800","178,400",24.5,3.4

In [4]:
search ='E09'
E09=df_ed['Code'].str.startswith(search) 
df_ed[E09]

,Code,Area,Year,Qualifications of working age population (16-64),number,denominator,percent,confidence
0,E09000001,City of London,2004,NVQ4+,"3,500","4,300",80.6,*
1,E09000002,Barking and Dagenham,2004,NVQ4+,"14,300","101,800",14.1,3
2,E09000003,Barnet,2004,NVQ4+,"77,100","206,600",37.3,4
3,E09000004,Bexley,2004,NVQ4+,"21,400","134,900",15.8,3.3
4,E09000005,Brent,2004,NVQ4+,"43,800","178,400",24.5,3.4
...,...,...,...,...,...,...,...,...
5537,E09000029,Sutton,2019,no qualifications,9800,131800,7.4,2.3
5538,E09000030,Tower Hamlets,2019,no qualifications,22800,235600,9.7,2.9
5539,E09000031,Waltham Forest,2019,no qualifications,16800,188900,8.9,3
5540,E09000032,Wandsworth,2019,no qualifications,9800,235200,4.1,2
5541,E09000033,Westminster,2019,no qualifications,9900,172200,5.8,2.5

In [ ]:
'''E09 = df_ed['Code'].map(lambda x: x.startswith('E09'))
E09'''

In [5]:
NVQ4 = df_ed[E09][(df_ed[E09]['Qualifications of working age population (16-64)']=='NVQ4+')]
NVQ4

,Code,Area,Year,Qualifications of working age population (16-64),number,denominator,percent,confidence
0,E09000001,City of London,2004,NVQ4+,"3,500","4,300",80.6,*
1,E09000002,Barking and Dagenham,2004,NVQ4+,"14,300","101,800",14.1,3
2,E09000003,Barnet,2004,NVQ4+,"77,100","206,600",37.3,4
3,E09000004,Bexley,2004,NVQ4+,"21,400","134,900",15.8,3.3
4,E09000005,Brent,2004,NVQ4+,"43,800","178,400",24.5,3.4
...,...,...,...,...,...,...,...,...
5243,E09000029,Sutton,2019,NVQ4+,60500,131800,45.9,4.3
5244,E09000030,Tower Hamlets,2019,NVQ4+,142500,235600,60.5,4.8
5245,E09000031,Waltham Forest,2019,NVQ4+,94800,188900,50.2,5.2
5246,E09000032,Wandsworth,2019,NVQ4+,168300,235200,71.6,4.5
5247,E09000033,Westminster,2019,NVQ4+,112700,172200,65.5,5.1

In [9]:
NVQ4.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 495 entries, 0 to 5247
Data columns (total 8 columns):
 #   Column                                            Non-Null Count  Dtype
---  ------                                            --------------  -----
 0   Code                                              495 non-null    object
 1   Area                                              495 non-null    object
 2   Year                                              495 non-null    int64
 3   Qualifications of working age population (16-64)  495 non-null    object
 4   number                                            495 non-null    object
 5   denominator                                       495 non-null    object
 6   percent                                           495 non-null    object
 7   confidence                                        495 non-null    object
dtypes: int64(1), object(7)
memory usage: 34.8+ KB

In [11]:
df_edu = NVQ4[NVQ4.Year>2014][['Code','Area','Year','Qualifications of working age population (16-64)','percent']]
df_edu

,Code,Area,Year,Qualifications of working age population (16-64),percent
3815,E09000001,City of London,2015,NVQ4+,80
3816,E09000002,Barking and Dagenham,2015,NVQ4+,32.4
3817,E09000003,Barnet,2015,NVQ4+,49.1
3818,E09000004,Bexley,2015,NVQ4+,33.6
3819,E09000005,Brent,2015,NVQ4+,45.1
...,...,...,...,...,...
5243,E09000029,Sutton,2019,NVQ4+,45.9
5244,E09000030,Tower Hamlets,2019,NVQ4+,60.5
5245,E09000031,Waltham Forest,2019,NVQ4+,50.2
5246,E09000032,Wandsworth,2019,NVQ4+,71.6
5247,E09000033,Westminster,2019,NVQ4+,65.5

In [30]:
#df_ed_ = df_ed.groupby(['Code','Area','Year','Qualifications of working age population (16-64)'])